blog/Java-Beginner/2022-05-13-What-is-JShell.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-05-18 Wed 20:38 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>What is JShell?</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<link rel='stylesheet' href='/css/style.css' type='text/css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <a id='toggle'>&equiv;</a>
  <a class='nav-link' href='/'>Home</a>
  <a class='nav-link' href='/blog'>Blog</a>
  <a class='nav-link' href='http://github.com/MrWalshy'>GitHub</a>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">What is JShell?</h1>
<p class="subtitle">A short introduction to the Java REPL tool - Java 11 tutorials</p>
</header><p>
JShell is a REPL tool, Read-Eval-Print-Loop, for experimenting with Java code to get immediate results.
</p>

<div id="outline-container-org886a81f" class="outline-2">
<h2 id="org886a81f">Opening JShell</h2>
<div class="outline-text-2" id="text-org886a81f">
<p>
To open the JShell tool, ensure you have Java on your system path and enter jshell into the console. 
You should see something like the following if JShell opened correctly:
</p>

<pre class="example">
$ jshell 
| Welcome to JShell -- Version 17.0.1 
| For an introduction type: /help intro

jshell&gt; 
</pre>
</div>
</div>

<div id="outline-container-orge5eabbc" class="outline-2">
<h2 id="orge5eabbc">Useful commands</h2>
<div class="outline-text-2" id="text-orge5eabbc">
<p>
The following commands will be useful for interacting with JShell:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Command</td>
<td class="org-left">Description</td>
</tr>

<tr>
<td class="org-left">{/exit}</td>
<td class="org-left">Exits the JShell tool</td>
</tr>

<tr>
<td class="org-left">{/list}</td>
<td class="org-left">Lists a history of executed code snippets</td>
</tr>

<tr>
<td class="org-left">{/save snippet.txt}</td>
<td class="org-left">Saves all entered code snippets in the current session to the specified file</td>
</tr>

<tr>
<td class="org-left">{/open snippet.txt}</td>
<td class="org-left">Opens and loads the code snippets from the specified file</td>
</tr>

<tr>
<td class="org-left">{/reset}</td>
<td class="org-left">Resets the state of the JShell tool, deleting all snippets in its history</td>
</tr>

<tr>
<td class="org-left">{/help}</td>
<td class="org-left">Opens the help menu</td>
</tr>

<tr>
<td class="org-left">{/vars}</td>
<td class="org-left">Lists declared variables</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5d753ce" class="outline-2">
<h2 id="org5d753ce">Exploratory programming</h2>
<div class="outline-text-2" id="text-org5d753ce">
<p>
In Java, we can perform the standard Arithmetic operations like addition, subtraction, multiplication, and division. If I enter <code>3 + 3;</code> into JShell for example, I will get the following result:
</p>

<pre class="example">
jshell&gt; 3 + 3; 
$1 ==&gt; 6 
</pre>

<p>
What has happened here is that the Java code has been executed and a temporary variable has been created to store the result of the addition, a <b>variable</b> stores data for us and has an associated name. If I enter the name of the new variable, <code>$1</code>, into the console it will return <code>$1 ==&gt; 6</code> – this is informing us that the variable named <code>$1</code> points to the value of <code>6</code>. We can also pass a variable as input to a method, where a <b>method</b> is just a reusable block of code with a name, such as with the <code>println()</code> method:
</p>

<pre class="example">
jshell&gt; System.out.println($1); 
6
</pre>

<p>
Try entering the following expressions into JShell and noting their results:
</p>

<ul class="org-ul">
<li><code>3 * 3</code></li>
<li><code>3 / 3</code></li>
<li><code>3 / 0</code></li>
<li><code>3 - 3</code></li>
<li><code>(3 + 3) * 3</code></li>
<li><code>3 + 3 * 3</code></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <small>
    Copyright 2022 Morgan Walsh.<br />
    Last updated 2022-05-18 Wed 20:37. <br />
    Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9). <br />
    <a href="/html/bug-report.html">Submit a bug report</a>
  </small>
</footer>
<script src='/js/navbar.js'></script>
</div>
</body>
</html>
